Autodesk.Revit.DB.BuiltInFailures.StructuralSectionsFailures.StructuralSectionShapesDoNotMatch
Family Shape does not match the geometry of the element.

Autodesk.Revit.DB.BuiltInFailures.StructuralSectionsFailures.StructuralSectionCannotBeDetermined
The section cannot be determined.

Autodesk.Revit.DB.BuiltInFailures.StructuralSectionsFailures
Failures about Structural Sections.